app/views/restaurantes/show.html.erb

<b>Nota media</b>
	<%= @restaurante.qualificacoes.average(:nota)%><br/>
<b> Qualificacoes</b>
	<%= @restaurante.qualificacoes.count %><br/>
<b>Preco medio</b>
	<%= @restaurante.qualificacoes.average(:valor_gasto) %><br/>
---
SELECT AVG(`qualificacoes`.`nota`) AS avg_id FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 4
SELECT COUNT(*) FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 4
SELECT AVG(`qualificacoes`.`valor_gasto`) AS avg_id FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 4