app/controllers/comentarios_controller.rb

SELECT `comentarios`.* FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1
---
  def show
    @comentario = Comentario.find(params[:id])

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1
---
  def edit
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`comentavel_id`, `comentavel_type`, `conteudo`, `created_at`, `updated_at`) VALUES (2, 'Restaurantes', 'aasdfjalskjdfklasjdflkasjfdlkasjfdlaksjdflaksjfdalskjfdalksfas', '2013-07-18 00:50:39', '2013-07-18 00:50:39')
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1
UPDATE `comentarios` SET `comentavel_id` = 3, `updated_at` = '2013-07-18 01:19:30' WHERE `comentarios`.`id` = 1
---
  def update
    @comentario = Comentario.find(params[:id])

    respond_to do |format|
      if @comentario.update_attributes(params[:comentario])

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 6 LIMIT 1
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 6
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy