app/controllers/restaurantes_controller.rb

	def index
		#retornando a lista de nome
		#@restaurantes = Restaurante.order :nome
		#deixando paginando com kaminari
    @restaurantes = Restaurante.order("nome").page(params['page']).per(3)
---
SELECT COUNT(*) FROM `restaurantes`
SELECT `restaurantes`.* FROM `restaurantes` ORDER BY nome LIMIT 3 OFFSET 0

	def destroy
		@restaurante.delete
---
DELETE FROM `restaurantes` WHERE `restaurantes`.`id` = 5

	def create
	   @restaurante = Restaurante.new(params[:restaurante])
		if @restaurante.save
---
INSERT INTO `restaurantes` (`created_at`, `endereco`, `especialidade`, `nome`, `updated_at`) VALUES ('2013-07-16 23:03:41', 'Rua do apiares', 'Queijo', 'Boa jose', '2013-07-16 23:03:41')

	def update
		if @restaurante.update_attributes(params[:restaurante])
---
UPDATE `restaurantes` SET `foto_file_name` = 'esquilo-5702.jpg', `foto_content_type` = 'image/jpeg', `foto_file_size` = 372429, `foto_updated_at` = '2013-07-20 00:09:56', `updated_at` = '2013-07-20 00:09:56' WHERE `restaurantes`.`id` = 2

	def set_restaurante
		@restaurante = Restaurante.find(params[:id])
---
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 7 LIMIT 1